/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_env.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ajeanett <ajeanett@42.ru>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/27 08:53:46 by gmarva            #+#    #+#             */
/*   Updated: 2020/12/24 20:40:04 by ajeanett         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishell.h"

int	ft_env(t_all *all)
{
	int i;
	int j;

	i = -1;
	while (all->env[++i] != 0)
	{
		j = -1;
		while (all->env[i][++j] != 0)
		{
			if (all->env[i][j] == '=')
			{
				ft_putendl_fd(all->env[i], 1);
				continue ;			
			}
		}
	}

	// должен показывать b=""
	// Сравнить подробно с оригинальной выдачей b
	// Как работает с $?
	all->res = 0;
	return (0);
	
}