/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_pwd.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ajeanett <ajeanett@42.ru>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/27 07:22:02 by gmarva            #+#    #+#             */
/*   Updated: 2020/12/24 20:40:36 by ajeanett         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishell.h"

int		ft_pwd(t_all *all)
{
	char	dir[10000];
	int		i;

	i = 0;
	if (all->arg[0] != 0)
		i++;
	getcwd(dir, 10000);
	ft_putendl_fd(dir, 1);
	// Обработать ошибки
	// s_res
	all->res = 0;
	return (0);
}